org/lrn/java/index.org
#+STARTUP: showall indent hidestars

* Интенсив по Java

Этот интенсив рассчитан на 3-5 дней. За это время мы создаем простую игру [[https://ru.wikipedia.org/wiki/Breakout_(%D0%B8%D0%B3%D1%80%D0%B0)][Breakout]]
([[https://ru.wikipedia.org/wiki/Arkanoid][Arkanoid]]) с использованием ~JavaSE~ и графической библиотеки ~libGDX~.

Геймплей: Игрок контролирует небольшую платформу-ракетку, которую можно передвигать
горизонтально от одной стенки до другой, подставляя её под шарик, предотвращая его
падение вниз. Удар шарика по кирпичу приводит к разрушению кирпича.

- [[file:./setup.org][Установка всего необходимого]]
- [[file:./gameclass.org][Анализируем MyGdxGame]]
- [[file:./control.org][Управление и физика]]
- [[file:./bricks.org][Разбиваемые элементы]]
- [[file:./platform.org][Платформа]]
- [[file:./endgame.org][Завершение игры]]
