www/lrn/java/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7ec388d">Интенсив по Java</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7ec388d" class="outline-2">
<h2 id="org7ec388d">Интенсив по Java</h2>
<div class="outline-text-2" id="text-org7ec388d">
<p>
Этот интенсив рассчитан на 3-5 дней. За это время мы создаем простую игру <a href="https://ru.wikipedia.org/wiki/Breakout_(%D0%B8%D0%B3%D1%80%D0%B0)">Breakout</a>
(<a href="https://ru.wikipedia.org/wiki/Arkanoid">Arkanoid</a>) с использованием <code>JavaSE</code> и графической библиотеки <code>libGDX</code>.
</p>

<p>
Геймплей: Игрок контролирует небольшую платформу-ракетку, которую можно передвигать
горизонтально от одной стенки до другой, подставляя её под шарик, предотвращая его
падение вниз. Удар шарика по кирпичу приводит к разрушению кирпича.
</p>

<ul class="org-ul">
<li><a href="./setup.html">Установка всего необходимого</a></li>
<li><a href="./gameclass.html">Анализируем MyGdxGame</a></li>
<li><a href="./control.html">Управление и физика</a></li>
<li><a href="./bricks.html">Разбиваемые элементы</a></li>
<li><a href="./platform.html">Платформа</a></li>
<li><a href="./endgame.html">Завершение игры</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
